#Использовать asserts
#Использовать "../src"

&Тест
Процедура ЛямбдаВыполняется() Экспорт

	// Дано

	Параметры = Новый Массив();
	Параметры.Добавить(1);
	Параметры.Добавить(2);

	// Когда

	Обещание = Обещания.ВыполнитьЛямбду(
		"(Первое, Второе) -> Возврат СложитьСЗадержкой(Первое, Второе)",
		ЭтотОбъект,
		Параметры
	);

	// Тогда

	Утверждения.ПроверитьРавенство(Обещание.Получить(), 3);

КонецПроцедуры

&Тест
Процедура ДелегатВыполняется() Экспорт

	// Дано

	Параметры = Новый Массив();
	Параметры.Добавить(1);
	Параметры.Добавить(2);

	// Когда

	Обещание = Обещания.ВыполнитьДелегат(
		Новый Действие(ЭтотОбъект, "СложитьСЗадержкой"),
		Параметры
	);

	// Тогда

	Утверждения.ПроверитьРавенство(Обещание.Получить(), 3);

КонецПроцедуры

Функция СложитьСЗадержкой(Первое, Второе) Экспорт

	Приостановить(100);

	Возврат Первое + Второе;

КонецФункции
