#Использовать lambdas
#Использовать "../internal"

#Область ПрограммныйИнтерфейс

// Выполняет асинхронно переданную лямбду
//
// Параметры:
//  Алгоритм  - Строка - Лямбда выражение которое требуется исполнить
//  Объект    - Сценарий - Объект который необходимо захватить в лямбду
//  Параметры - Массив из Произвольный - Параметры алгоритма
//
// Возвращаемое значение:
//  Обещание - Обещание о выполнении переданного алгоритма
//
Функция ВыполнитьЛямбду(Знач Алгоритм, Объект, Параметры) Экспорт

	Алгоритм = Лямбда.Выражение(Алгоритм)
		.ЗахватитьОбъект(Объект)
		.ВДействие();

	Результат = Новый Обещание(Алгоритм, Параметры);

	АсинхронностьСлужебный.ЗапуститьВыполнениеОбещания(Результат);

	Возврат Результат;

КонецФункции

// Выполняет асинхронно переданный делегат
//
// Параметры:
//  Действие  - Действие - Делегат на метод который требуется исполнить
//  Параметры - Массив из Произвольный - Параметры метода
//
// Возвращаемое значение:
//  Обещание - Обещание о выполнении переданного метода
//
Функция ВыполнитьДелегат(Действие, Параметры) Экспорт

	Результат = Новый Обещание(Действие, Параметры);

	АсинхронностьСлужебный.ЗапуститьВыполнениеОбещания(Результат);

	Возврат Результат;

КонецФункции

#КонецОбласти
